import { FaRegCircleQuestion } from "react-icons/fa6";

const faqs = [
  {
    question: "چگونه می‌توانم بلیط هواپیما را به صورت آنلاین رزرو کنم؟",
    answer:
      "به آسانی می‌توانید با مراجعه به وب سایت ما و انتخاب مبدا، مقصد، تاریخ سفر و تعداد مسافران، بلیط خود را رزرو کنید. سپس می‌توانید از بین پروازهای مختلف ایرلاین‌ها و کلاس‌های پروازی مختلف، گزینه مورد نظر خود را انتخاب کرده و مراحل پرداخت را طی کنید.",
  },
  {
    question: "تفاوت بلیط سیستمی و چارتر چیست؟",
    answer:
      "بلیط‌های سیستمی توسط ایرلاین‌ها ارائه می‌شوند و قیمت ثابتی دارند. در مقابل، بلیط‌های چارتر توسط آژانس‌های هواپیمایی به صورت عمده از ایرلاین‌ها خریداری شده و با قیمتی پایین‌تر به مسافران عرضه می‌شوند. بلیط‌های چارتر معمولا قابل استرداد یا تغییر تاریخ نیستند.",
  },
  {
    question: "حداکثر بار مجاز در پروازهای داخلی و خارجی چقدر است؟",
    answer:
      "حداکثر بار مجاز در پروازها به عوامل مختلفی مانند کلاس پروازی، ایرلاین و مسیر پرواز بستگی دارد. به طور کلی، در پروازهای داخلی حداکثر 20 تا 25 کیلوگرم بار مجاز است و در پروازهای خارجی این مقدار بین 30 تا 40 کیلوگرم متغیر است. اطلاعات دقیق مربوط به حداکثر بار مجاز را می‌توانید در بخشاطلاعات پرواز در وب سایت ما مشاهده کنید.",
  },
  {
    question: " شرایط تغییر تاریخ یا کنسلی بلیط چگونه است؟",
    answer:
      "شرایط تغییر تاریخ یا کنسلی بلیط به نوع بلیط (سیستمی یا چارتر) و قوانین ایرلاین مربوطه بستگی دارد. به طور کلی، برای بلیط‌های سیستمی امکان تغییر تاریخ یا کنسلی با پرداخت جریمه وجود دارد، اما بلیط‌های چارتر معمولا قابل استرداد یا تغییر تاریخ نیستند.",
  },
  {
    question: "چگونه می‌توانم از وضعیت پرواز خود مطلع شوم؟",
    answer:
      "شما می‌توانید با وارد کردن کد رزرو و نام خانوادگی خود در بخش اطلاعات پرواز در وب سایت ما، از وضعیت پرواز خود، اعم از ساعت پرواز، تاخیر یا لغو احتمالی، مطلع شوید.",
  },
  {
    question: "برای پرواز چه مدارکی لازم است؟",
    answer:
      "برای پروازهای داخلی، ارائه کارت ملی یا شناسنامه کافی است. اما برای پروازهای خارجی، علاوه بر گذرنامه، ممکن است به ویزا نیز نیاز داشته باشید. توصیه می‌کنیم قبل از سفر، از قوانین و مقررات مربوط به مدارک مورد نیاز برای اتباع ایرانی در کشور مقصد مطلع شوید.",
  },
];

const Faq = () => {
  return (
    <div className="flex flex-col gap-10 mx-32 p-4 mb-20">
      <h2 className="desktop:text-xl xs:text-xl text-black font-bold flex items-center gap-2">
        <FaRegCircleQuestion className="text-[gold]" size={20} />
        سوالات متداول
      </h2>
      <div className="space-y-4">
        {faqs.map((faq, index) => (
          <div
            key={index}
            className="collapse collapse-arrow gap-3  bg-slate-100"
          >
            <input
              type="radio"
              name="my-accordion"
              id={`faq-item-${index}`}
              defaultChecked
            />
            <div className="collapse-title text-base font-medium flex gap-2 items-center text-gray-600">
              <FaRegCircleQuestion className="text-[#9333ea]" />

              {faq.question}
            </div>
            <div className="collapse-content text-base text-gray-500">
              <p>{faq.answer}</p>
            </div>
          </div>
        ))}
      </div>
    </div>
  );
};

export default Faq;
