// import { IoIosArrowBack } from "react-icons/io";

const Sectionthree = () => {
  return (
    <div className="px-24 flex flex-col gap-7 mb-20">
      <div className="grid grid-cols-2 gap-5">
        <div className="flex flex-col gap-4">
          <h1 className="text-black font-bold">پشتیبانی عالی</h1>
          <p className="text-sm text-gray-700 leading-10">
            پشتیبانی مشتریان، قلب تپنده هر کسب‌وکاری است. یک پشتیبانی عالی، نه
            تنها به حل مشکلات مشتریان کمک می‌کند بلکه باعث ایجاد رابطه قوی و
            پایدار با آن‌ها می‌شود. زمانی که مشتریان با مشکلی مواجه می‌شوند،
            انتظار دارند که به سرعت و با احترام به آن‌ها پاسخ داده شود. یک تیم
            پشتیبانی حرفه‌ای، با دانش کافی از محصولات یا خدمات شرکت، می‌تواند در
            کوتاه‌ترین زمان ممکن به سوالات مشتریان پاسخ دهد و مشکلات آن‌ها را
            برطرف کند. پشتیبانی عالی، وفاداری مشتریان را افزایش می‌دهد و در
            نهایت به رشد و موفقیت کسب‌وکار کمک می‌کند.
          </p>
          {/* <span className="flex gap-2 items-center cursor-pointer text-[#9333ea]">
            اطلاعات بیشتر
            <IoIosArrowBack />
          </span> */}
        </div>
        <div className="flex flex-col gap-4">
          <h1 className="text-black font-bold">خدمات آنلاین</h1>
          <p className="text-sm text-gray-700 leading-10">
            خدمات آنلاین، تحولی عظیم در نحوه ارائه خدمات ایجاد کرده است. امروزه،
            بسیاری از افراد ترجیح می‌دهند کارهای خود را به صورت آنلاین انجام
            دهند و از خدمات مختلف به صورت غیرحضوری بهره‌مند شوند. خدمات آنلاین،
            محدودیت‌های زمانی و مکانی را از بین می‌برد و دسترسی به خدمات را برای
            همه آسان‌تر می‌کند. با پیشرفت فناوری، خدمات آنلاین روز به روز
            متنوع‌تر و هوشمندتر می‌شوند. از خرید آنلاین گرفته تا خدمات بانکی و
            مشاوره آنلاین، همه و همه به صورت آنلاین قابل دسترسی هستند. خدمات
            آنلاین، راحتی و سرعت را برای مشتریان به ارمغان می‌آورد و به
            کسب‌وکارها کمک می‌کند تا به مشتریان بیشتری دسترسی پیدا کنند.
          </p>
          {/* <span className="flex gap-2 items-center cursor-pointer text-[#9333ea]">
            اطلاعات بیشتر
            <IoIosArrowBack />
          </span> */}
        </div>
      </div>
      <div className="text-gray-700 leading-10">
        آیا آماده‌اید تا سفر رویایی خود را آغاز کنید؟ با رزرو آنلاین بلیط از
        طریق سایت ما، تنها با چند کلیک ساده به مقصد دلخواه خود برسید. ما به شما
        اطمینان می‌دهیم که بهترین قیمت‌ها و متنوع‌ترین خدمات را در اختیار شما
        قرار می‌دهیم. برای مشاهده‌ی لیست کامل مقاصد و رزرو بلیط، همین حالا بر
        روی دکمه‌ی
        <span className="text-[gold] cursor-pointer hover:text-[goldenrod]">
          {" "}
          خرید از پرنت{" "}
        </span>
        کلیک کنید و لذت ببرید .
      </div>
    </div>
  );
};

export default Sectionthree;
